In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Rent Data.csv')

In [4]:
df2 = pd.read_csv('supershops.csv')

In [3]:
df.head()

   area   rent
0  2000  31500
1  2100  35000
2  2500  41050
3  2250  36100
4  3000  52100

In [5]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [6]:
#StandardScaler

In [7]:
from sklearn.preprocessing import StandardScaler

In [8]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [9]:
sd = StandardScaler()

In [10]:
scaled1 = sd.fit(df2[['Marketing Spend']])

In [12]:
df2['Marketing Spend'] = sd.transform(df2[['Marketing Spend']])

In [13]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913       136897.80  471784.10    Dhaka  192261.83
1         1.955860       151377.59  443898.53      Ctg  191792.06
2         1.754364       101145.55  407934.54  Rangpur  191050.39
3         1.554784       118671.85  383199.62    Dhaka  182901.99
4         1.504937        91391.77  366168.42  Rangpur  166187.94

In [14]:
df2['Administration']= sd.fit_transform(df2[['Administration']])

In [15]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

In [17]:
df2['Transport']= sd.fit_transform(df2[['Transport']])

In [18]:
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

In [20]:
df2['Profit']= sd.fit_transform(df2[['Profit']])

In [21]:
df2.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.897913        0.560753   2.165287    Dhaka  2.011203
1         1.955860        1.082807   1.929843      Ctg  1.999430
2         1.754364       -0.728257   1.626191  Rangpur  1.980842
3         1.554784       -0.096365   1.417348    Dhaka  1.776627
4         1.504937       -1.079919   1.273550  Rangpur  1.357740

In [30]:
#MaxAbsScaler
from sklearn.preprocessing import MaxAbsScaler

In [23]:
mas = MaxAbsScaler()

In [24]:
df2['Administration']=mas.fit_transform(df2[['Administration']])

In [25]:
df2['Profit']= mas.fit_transform(df2[['Profit']])

In [26]:
df2['Transport']= mas.fit_transform(df2[['Transport']])

In [28]:
df2['Marketing Spend']=mas.fit_transform(df2[['Marketing Spend']])

In [29]:
df2.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.445303        0.560753   2.165287    Dhaka  2.011203
1         0.969971        1.082807   1.929843      Ctg  1.999430
2         0.870043       -0.728257   1.626191  Rangpur  1.980842
3         0.771065       -0.096365   1.417348    Dhaka  1.776627
4         0.746344       -1.079919   1.273550  Rangpur  1.357740

In [31]:
#Robust Scaler
from sklearn.preprocessing import RobustScaler

In [32]:
rs = RobustScaler()

In [33]:
df2['Marketing Spend'] = rs.fit_transform(df2[['Marketing Spend']])

In [34]:
df2['Administration'] = rs.fit_transform(df2[['Administration']])

In [35]:
df2['Transport'] = rs.fit_transform(df2[['Transport']])

In [40]:
df2['Profit'] = rs.fit_transform(df2[['Profit']])

In [41]:
df2.head()

   Marketing Spend  Administration  Transport     Area    Profit   Profite
0         0.672530        0.345355   1.552016    Dhaka  1.698340  1.698340
1         1.452113        0.697565   1.383714      Ctg  1.688874  1.688874
2         1.303634       -0.524290   1.166654  Rangpur  1.673929  1.673929
3         1.156567       -0.097977   1.017368    Dhaka  1.509736  1.509736
4         1.119836       -0.761543   0.914576  Rangpur  1.172943  1.172943